In [13]:
import pandas as pd

In [46]:
url = 'https://raw.githubusercontent.com/ocfurtado/Pandas_io/refs/heads/main/superstore_data.csv'

In [47]:
dados_mercado = pd.read_csv(url)

In [48]:
dados_mercado.head()

,Id,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain
0,1826,1970,Graduation,Divorced,84835.0,0,0,6/16/2014,0,189,...,111,189,218,1,4,4,6,1,1,0
1,1,1961,Graduation,Single,57091.0,0,0,6/15/2014,0,464,...,7,0,37,1,7,3,7,5,1,0
2,10476,1958,Graduation,Married,67267.0,0,1,5/13/2014,0,134,...,15,2,30,1,3,2,5,2,0,0
3,1386,1967,Graduation,Together,32474.0,1,1,11/5/2014,0,10,...,0,0,0,1,1,0,2,7,0,0
4,5371,1989,Graduation,Single,21474.0,1,0,8/4/2014,0,6,...,11,0,34,2,3,1,2,7,1,0

In [61]:
url_2 = 'https://raw.githubusercontent.com/ocfurtado/Pandas_io/refs/heads/main/superstore_data_ponto_virgula.csv'

In [62]:
dados_ponto_virgula = pd.read_csv(url_2, sep=';', encoding='ascii', nrows=5)

In [63]:
dados_ponto_virgula

,Id,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain
0,1826,1970,Graduation,Divorced,84835,0,0,6/16/2014,0,189,...,111,189,218,1,4,4,6,1,1,0
1,1,1961,Graduation,Single,57091,0,0,6/15/2014,0,464,...,7,0,37,1,7,3,7,5,1,0
2,10476,1958,Graduation,Married,67267,0,1,5/13/2014,0,134,...,15,2,30,1,3,2,5,2,0,0
3,1386,1967,Graduation,Together,32474,1,1,11/5/2014,0,10,...,0,0,0,1,1,0,2,7,0,0
4,5371,1989,Graduation,Single,21474,1,0,8/4/2014,0,6,...,11,0,34,2,3,1,2,7,1,0

In [67]:
dados_ponto_virgula.to_csv('dados_ponto_virgula_somente_5_linhas.csv', index=False)

In [45]:
import chardet

In [39]:
caminho_arquivo = r'C:\Users\omar.furtado\Desktop\Pandas_io\superstore_data_ponto_virgula.csv'

In [40]:
with open(caminho_arquivo, 'rb') as file:
    dados_brutos = file.read()

    resultado = chardet.detect(dados_brutos)

    encoding_detectado = resultado['encoding']
    confianca = resultado['confidence']

print(f"Encoding: {encoding_detectado} (Confiança: {confianca})")

Encoding: ascii (Confiança: 1.0)

In [68]:
dados_ponto_virgula_5_linhas = pd.read_csv(r'C:\Users\omar.furtado\Desktop\Pandas_io\Aula_1\dados_ponto_virgula_somente_5_linhas.csv')

In [69]:
dados_ponto_virgula_5_linhas

,Id,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain
0,1826,1970,Graduation,Divorced,84835,0,0,6/16/2014,0,189,...,111,189,218,1,4,4,6,1,1,0
1,1,1961,Graduation,Single,57091,0,0,6/15/2014,0,464,...,7,0,37,1,7,3,7,5,1,0
2,10476,1958,Graduation,Married,67267,0,1,5/13/2014,0,134,...,15,2,30,1,3,2,5,2,0,0
3,1386,1967,Graduation,Together,32474,1,1,11/5/2014,0,10,...,0,0,0,1,1,0,2,7,0,0
4,5371,1989,Graduation,Single,21474,1,0,8/4/2014,0,6,...,11,0,34,2,3,1,2,7,1,0

In [75]:
caminho_arquivo_dados_sus = r'C:\Users\omar.furtado\Desktop\Pandas_io\dados_sus.csv'

In [76]:
with open(caminho_arquivo_dados_sus, 'rb') as file:
    dados_brutos = file.read()

    resultado = chardet.detect(dados_brutos)

print(resultado)

{'encoding': 'ISO-8859-1', 'confidence': 0.73, 'language': ''}

In [128]:
dados_sus = pd.read_csv(caminho_arquivo_dados_sus, sep=';', skiprows=3, skipfooter=9, encoding='ISO-8859-1', engine='python')

In [129]:
dados_sus.head()

,Unidade da Federação,2008/Jan,2008/Fev,2008/Mar,2008/Abr,2008/Mai,2008/Jun,2008/Jul,2008/Ago,2008/Set,...,2020/Jul,2020/Ago,2020/Set,2020/Out,2020/Nov,2020/Dez,2021/Jan,2021/Fev,2021/Mar,Total
0,Rondônia,"1388528,39","2931283,42","1541682,52","1525314,96","1645953,84","1406150,68","3065279,01","3231494,61","3117178,63",...,"11824687,13","11733307,76","10201985,14","7955139,45","9357946,29","8880836,55","9266014,59","7730597,04","11023309,47","996411254,68"
1,Acre,"902416,00","1497206,26","1794028,48","1730469,42","1819443,92","1828496,00","2511754,59","2089107,14","2275708,53",...,"3915193,20","3640142,82","3391242,21","4044321,44","3276590,10","3696997,31","3715723,12","3538427,92","4077045,92","450048530,47"
2,Amazonas,"4735529,42","7118990,57","8196635,49","8259378,42","7831399,90","8477273,62","9368858,72","9352532,70","9363099,35",...,"19769460,14","18059931,43","17841015,63","16408315,10","19895617,91","17765167,69","21430289,17","25917134,55","22032176,22","1917247936,05"
3,Roraima,"657889,53","777939,31","718688,03","839994,39","862347,96","832440,66","996693,09","894271,18","910424,17",...,"3015488,30","2826486,18","2928043,91","3090313,73","3621031,05","3454460,94","3266928,47","3519773,73","3985530,08","328876965,09"
4,Pará,"18864744,11","19553758,20","21937342,70","20842829,69","23249952,88","23240687,56","24002223,56","23341218,03","25172261,32",...,"40804126,43","44385715,88","36820249,47","36965931,34","39004315,80","38015145,79","38354682,46","37688314,23","33276392,89","4705309002,29"

In [55]:
import pandas as pd
import chardet

In [ ]:
pagamentos_fornecedores = pd.read_csv(r'C:\Users\omar.furtado\Desktop\Pandas_io\Aula_1\pagamentos_fornecedores.csv', sep=';', dtype=)

In [57]:
with open(r'C:\Users\omar.furtado\Desktop\Pandas_io\Aula_1\pagamentos_fornecedores.csv', 'rb') as file:
    dados_bruto = file.read()

    resultado = chardet.detect(dados_bruto)

print(resultado)

{'encoding': 'UTF-8-SIG', 'confidence': 1.0, 'language': ''}

In [58]:
pagamentos_fornecedores

,cod_fornecedor,nome_fornecedor,data_pagamento,valor_pago,status
0,F-0012,Açougue São José Ltda,15/01/2025,"3450,9",pago
1,F-0013,Padaria São Lucas Ltda,15/02/2025,"156,8",pendente
2,F-0014,Supermercado Lotus Ltda,16/03/2025,"1547,9",pago
3,F-0015,Restaurante Claretiano Ltda,20/04/2025,"3465,89",pendente
4,F-0016,Lanchonete Mila Ltda,28/05/2025,3000,NaN

In [59]:
pagamentos_fornecedores['valor_pago'] = pagamentos_fornecedores['valor_pago'].str.replace('.', '', regex=False).str.replace(',', '.').astype(float)

In [60]:
pagamentos_fornecedores

,cod_fornecedor,nome_fornecedor,data_pagamento,valor_pago,status
0,F-0012,Açougue São José Ltda,15/01/2025,3450.90,pago
1,F-0013,Padaria São Lucas Ltda,15/02/2025,156.80,pendente
2,F-0014,Supermercado Lotus Ltda,16/03/2025,1547.90,pago
3,F-0015,Restaurante Claretiano Ltda,20/04/2025,3465.89,pendente
4,F-0016,Lanchonete Mila Ltda,28/05/2025,3000.00,NaN

In [67]:
pagamentos_fornecedores['status'] = pagamentos_fornecedores['status'].fillna('não informado')

In [68]:
pagamentos_fornecedores

,cod_fornecedor,nome_fornecedor,data_pagamento,valor_pago,status
0,F-0012,Açougue São José Ltda,2025-01-15,3450.90,pago
1,F-0013,Padaria São Lucas Ltda,2025-02-15,156.80,pendente
2,F-0014,Supermercado Lotus Ltda,2025-03-16,1547.90,pago
3,F-0015,Restaurante Claretiano Ltda,2025-04-20,3465.89,pendente
4,F-0016,Lanchonete Mila Ltda,2025-05-28,3000.00,não informado

In [69]:
pagamentos_fornecedores['data_pagamento'] = pd.to_datetime(pagamentos_fornecedores['data_pagamento'], format='%d/%m/%Y')

In [70]:
pagamentos_fornecedores.dtypes

cod_fornecedor                str
nome_fornecedor               str
data_pagamento     datetime64[us]
valor_pago                float64
status                        str
dtype: object

In [ ]:
pagamentos_fornecedores.to_csv('pagamentos_limpo.csv', sep=',', index=False, encoding='UTF-8')

In [49]:
pagamentos_fornecedores['cod_fornecedor'] = pagamentos_fornecedores['cod_fornecedor'].astype(str)

In [50]:
pagamentos_fornecedores.dtypes

cod_fornecedor                str
nome_fornecedor               str
data_pagamento     datetime64[ns]
valor_pago                float64
status                        str
dtype: object

In [52]:
pd.read_csv('pagamentos_fornecedores.csv')

                                                   cod_fornecedor;nome_fornecedor;data_pagamento;valor_pago;status
F-0012;Açougue São José Ltda;15/01/2025;3450                                                   9;pago
F-0013;Padaria São Lucas Ltda;15/02/2025;156                                               8;pendente
F-0014;Supermercado Lotus Ltda;16/03/2025;1547                                                 9;pago
F-0015;Restaurante Claretiano Ltda;20/04/2025;3465                                        89;pendente
F-0016;Lanchonete Mila Ltda;28/05/2025;3000;                                                      NaN

In [54]:
pagamentos_fornecedores['valor_pago'] = pagamentos_fornecedores['valor_pago'].str.replace('.', '', regex=False).str.replace(',', '.')

AttributeError: Can only use .str accessor with string values, not floating

In [71]:
print(pagamentos_fornecedores.columns.tolist())

['cod_fornecedor', 'nome_fornecedor', 'data_pagamento', 'valor_pago', 'status']

In [72]:
print(pagamentos_fornecedores.columns)

Index(['cod_fornecedor', 'nome_fornecedor', 'data_pagamento', 'valor_pago',
       'status'],
      dtype='str')